Ran Plan for dir: `terragrunt-integration/terraform` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' 'terragrunt run plan --all' in '/home/atlantis/.atlantis/repos/jefersonlemos/atlantis-playground/24/default/terragrunt-integration/terraform': exit status 1: running "terragrunt run plan --all" in "/home/atlantis/.atlantis/repos/jefersonlemos/atlantis-playground/24/default/terragrunt-integration/terraform": 
20:24:10.468 WARN   The `TERRAGRUNT_TFPATH` environment variable is deprecated and will be removed in a future version of Terragrunt. Use `TG_TF_PATH=terraform1.11.4` instead.
20:24:10.480 INFO   The runner at . will be processed in the following order for command plan:
Group 1
- Unit .
- Unit ./modules/random

Group 2
- Unit ./app1
- Unit ./app2


20:24:10.715 STDOUT [modules/random] terraform1.11.4: Terraform used the selected providers to generate the following execution
20:24:10.715 STDOUT [modules/random] terraform1.11.4: plan. Resource actions are indicated with the following symbols:
20:24:10.716 STDOUT [modules/random] terraform1.11.4:   + create
20:24:10.716 STDOUT [modules/random] terraform1.11.4: Terraform will perform the following actions:
20:24:10.716 STDOUT [modules/random] terraform1.11.4:   # random_string.base_bucket_name will be created
20:24:10.716 STDOUT [modules/random] terraform1.11.4:   + resource "random_string" "base_bucket_name" {
20:24:10.716 STDOUT [modules/random] terraform1.11.4:       + id          = (known after apply)
20:24:10.716 STDOUT [modules/random] terraform1.11.4:       + length      = 4
20:24:10.716 STDOUT [modules/random] terraform1.11.4:       + lower       = true
20:24:10.716 STDOUT [modules/random] terraform1.11.4:       + min_lower   = 0
20:24:10.716 STDOUT [modules/random] terraform1.11.4:       + min_numeric = 0
20:24:10.716 STDOUT [modules/random] terraform1.11.4:       + min_special = 0
20:24:10.716 STDOUT [modules/random] terraform1.11.4:       + min_upper   = 0
20:24:10.716 STDOUT [modules/random] terraform1.11.4:       + number      = false
20:24:10.716 STDOUT [modules/random] terraform1.11.4:       + numeric     = false
20:24:10.716 STDOUT [modules/random] terraform1.11.4:       + result      = (known after apply)
20:24:10.716 STDOUT [modules/random] terraform1.11.4:       + special     = false
20:24:10.716 STDOUT [modules/random] terraform1.11.4:       + upper       = true
20:24:10.716 STDOUT [modules/random] terraform1.11.4:     }
20:24:10.716 STDOUT [modules/random] terraform1.11.4: Plan: 1 to add, 0 to change, 0 to destroy.
20:24:10.716 STDOUT [modules/random] terraform1.11.4: 
20:24:10.716 STDOUT [modules/random] terraform1.11.4: Changes to Outputs:
20:24:10.716 STDOUT [modules/random] terraform1.11.4:   + base_bucket_name = (known after apply)
20:24:10.727 STDOUT terraform1.11.4: Terraform used the selected providers to generate the following execution
20:24:10.727 STDOUT terraform1.11.4: plan. Resource actions are indicated with the following symbols:
20:24:10.727 STDOUT terraform1.11.4:   + create
20:24:10.727 STDOUT terraform1.11.4: Terraform will perform the following actions:
20:24:10.727 STDOUT terraform1.11.4:   # random_string.base_bucket_name will be created
20:24:10.727 STDOUT terraform1.11.4:   + resource "random_string" "base_bucket_name" {
20:24:10.727 STDOUT terraform1.11.4:       + id          = (known after apply)
20:24:10.727 STDOUT terraform1.11.4:       + length      = 4
20:24:10.727 STDOUT terraform1.11.4:       + lower       = true
20:24:10.727 STDOUT terraform1.11.4:       + min_lower   = 0
20:24:10.727 STDOUT terraform1.11.4:       + min_numeric = 0
20:24:10.727 STDOUT terraform1.11.4:       + min_special = 0
20:24:10.727 STDOUT terraform1.11.4:       + min_upper   = 0
20:24:10.727 STDOUT terraform1.11.4:       + number      = false
20:24:10.727 STDOUT terraform1.11.4:       + numeric     = false
20:24:10.727 STDOUT terraform1.11.4:       + result      = (known after apply)
20:24:10.727 STDOUT terraform1.11.4:       + special     = false
20:24:10.727 STDOUT terraform1.11.4:       + upper       = true
20:24:10.727 STDOUT terraform1.11.4:     }
20:24:10.727 STDOUT terraform1.11.4: Plan: 1 to add, 0 to change, 0 to destroy.
20:24:10.727 STDOUT terraform1.11.4: 
20:24:10.727 STDOUT terraform1.11.4: Changes to Outputs:
20:24:10.727 STDOUT terraform1.11.4:   + base_bucket_name = (known after apply)
20:24:10.779 WARN   [app2] Config ./commons.hcl is a dependency of ./app2/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
20:24:10.779 WARN   [app1] Config ./commons.hcl is a dependency of ./app1/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
20:24:18.463 STDOUT [app1] terraform1.11.4: Planning failed. Terraform encountered an error while generating this plan.
20:24:18.464 STDOUT [app1] terraform1.11.4: 
20:24:18.464 STDOUT [app1] terraform1.11.4: ╷
20:24:18.464 STDOUT [app1] terraform1.11.4: │ Warning: Argument is deprecated
20:24:18.464 STDERR [app1] terraform1.11.4: ╷
20:24:18.464 STDERR [app1] terraform1.11.4: │ Error: No valid credential sources found
20:24:18.464 STDERR [app1] terraform1.11.4: │ 
20:24:18.464 STDERR [app1] terraform1.11.4: │   with provider["registry.terraform.io/hashicorp/aws"],
20:24:18.464 STDERR [app1] terraform1.11.4: │   on bucket.tf line 11, in provider "aws":
20:24:18.464 STDERR [app1] terraform1.11.4: │   11: provider "aws" {
20:24:18.464 STDERR [app1] terraform1.11.4: │ 
20:24:18.464 STDOUT [app1] terraform1.11.4: │ 
20:24:18.464 STDOUT [app1] terraform1.11.4: │   with aws_s3_bucket.this,
20:24:18.464 STDOUT [app1] terraform1.11.4: │   on bucket.tf line 17, in resource "aws_s3_bucket" "this":
20:24:18.464 STDOUT [app1] terraform1.11.4: │   17:   acl    = "private"
20:24:18.464 STDOUT [app1] terraform1.11.4: │ 
20:24:18.464 STDOUT [app1] terraform1.11.4: │ acl is deprecated. Use the aws_s3_bucket_acl resource instead.
20:24:18.464 STDOUT [app1] terraform1.11.4: ╵
20:24:18.464 STDERR [app1] terraform1.11.4: │ Please see https://registry.terraform.io/providers/hashicorp/aws
20:24:18.464 STDERR [app1] terraform1.11.4: │ for more information about providing credentials.
20:24:18.464 STDERR [app1] terraform1.11.4: │ 
20:24:18.464 STDERR [app1] terraform1.11.4: │ Error: failed to refresh cached credentials, no EC2 IMDS role found,
20:24:18.464 STDERR [app1] terraform1.11.4: │ operation error ec2imds: GetMetadata, request canceled, context deadline
20:24:18.464 STDERR [app1] terraform1.11.4: │ exceeded
20:24:18.464 STDERR [app1] terraform1.11.4: │ 
20:24:18.464 STDERR [app1] terraform1.11.4: ╵
20:24:18.478 ERROR  [app1] terraform invocation failed in ./app1/.terragrunt-cache/v126U9jLjelVwLf3r07wLKt-eAo/9Jcw7tzvGZrNTV0TnqzTSoWPTFM
20:24:18.478 ERROR  [app1] Unit ./app1 has finished with an error
20:24:18.486 STDOUT [app2] terraform1.11.4: Planning failed. Terraform encountered an error while generating this plan.
20:24:18.486 STDOUT [app2] terraform1.11.4: 
20:24:18.487 STDOUT [app2] terraform1.11.4: ╷
20:24:18.487 STDOUT [app2] terraform1.11.4: │ Warning: Argument is deprecated
20:24:18.487 STDOUT [app2] terraform1.11.4: │ 
20:24:18.487 STDOUT [app2] terraform1.11.4: │   with aws_s3_bucket.this,
20:24:18.487 STDOUT [app2] terraform1.11.4: │   on bucket.tf line 17, in resource "aws_s3_bucket" "this":
20:24:18.487 STDOUT [app2] terraform1.11.4: │   17:   acl    = "private"
20:24:18.487 STDOUT [app2] terraform1.11.4: │ 
20:24:18.487 STDOUT [app2] terraform1.11.4: │ acl is deprecated. Use the aws_s3_bucket_acl resource instead.
20:24:18.487 STDOUT [app2] terraform1.11.4: ╵
20:24:18.487 STDERR [app2] terraform1.11.4: ╷
20:24:18.487 STDERR [app2] terraform1.11.4: │ Error: No valid credential sources found
20:24:18.487 STDERR [app2] terraform1.11.4: │ 
20:24:18.487 STDERR [app2] terraform1.11.4: │   with provider["registry.terraform.io/hashicorp/aws"],
20:24:18.487 STDERR [app2] terraform1.11.4: │   on bucket.tf line 11, in provider "aws":
20:24:18.487 STDERR [app2] terraform1.11.4: │   11: provider "aws" {
20:24:18.487 STDERR [app2] terraform1.11.4: │ 
20:24:18.487 STDERR [app2] terraform1.11.4: │ Please see https://registry.terraform.io/providers/hashicorp/aws
20:24:18.487 STDERR [app2] terraform1.11.4: │ for more information about providing credentials.
20:24:18.487 STDERR [app2] terraform1.11.4: │ 
20:24:18.487 STDERR [app2] terraform1.11.4: │ Error: failed to refresh cached credentials, no EC2 IMDS role found,
20:24:18.487 STDERR [app2] terraform1.11.4: │ operation error ec2imds: GetMetadata, request canceled, context deadline
20:24:18.488 STDERR [app2] terraform1.11.4: │ exceeded
20:24:18.488 STDERR [app2] terraform1.11.4: │ 
20:24:18.488 STDERR [app2] terraform1.11.4: ╵
20:24:18.509 ERROR  [app2] terraform invocation failed in ./app2/.terragrunt-cache/yWwOfNhttdvKoeqm2H9LVp_JiXI/9Jcw7tzvGZrNTV0TnqzTSoWPTFM
20:24:18.509 ERROR  [app2] Unit ./app2 has finished with an error
20:24:18.509 ERROR  Run failed: 2 errors occurred:

* Failed to execute "terraform1.11.4 plan -input=false" in ./app1/.terragrunt-cache/v126U9jLjelVwLf3r07wLKt-eAo/9Jcw7tzvGZrNTV0TnqzTSoWPTFM
  ╷
  │ Error: No valid credential sources found
  │ 
  │   with provider["registry.terraform.io/hashicorp/aws"],
  │   on bucket.tf line 11, in provider "aws":
  │   11: provider "aws" {
  │ 
  │ Please see https://registry.terraform.io/providers/hashicorp/aws
  │ for more information about providing credentials.
  │ 
  │ Error: failed to refresh cached credentials, no EC2 IMDS role found,
  │ operation error ec2imds: GetMetadata, request canceled, context deadline
  │ exceeded
  │ 
  ╵
  
  exit status 1

* Failed to execute "terraform1.11.4 plan -input=false" in ./app2/.terragrunt-cache/yWwOfNhttdvKoeqm2H9LVp_JiXI/9Jcw7tzvGZrNTV0TnqzTSoWPTFM
  ╷
  │ Error: No valid credential sources found
  │ 
  │   with provider["registry.terraform.io/hashicorp/aws"],
  │   on bucket.tf line 11, in provider "aws":
  │   11: provider "aws" {
  │ 
  │ Please see https://registry.terraform.io/providers/hashicorp/aws
  │ for more information about providing credentials.
  │ 
  │ Error: failed to refresh cached credentials, no EC2 IMDS role found,
  │ operation error ec2imds: GetMetadata, request canceled, context deadline
  │ exceeded
  │ 
  ╵
  
  exit status 1


>>>> PLANNING CHANGES <<<<

/home/atlantis/.atlantis/repos/jefersonlemos/atlantis-playground/24/default/terragrunt-integration/terraform

```
</details>